tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "hashicorp/tap/terraform"

brew 'zsh'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'git'
brew 'python'
brew 'pipenv'
brew 'ansible'
brew 'vim'
brew 'watch'
brew 'awscli'
brew 'jq'
brew 'tmux'
brew 'terraform'
brew 'terraform-ls'
brew 'telnet'
brew 'tree'
brew 'awk'
brew 'newsboat'
brew 'kubectl'
brew 'kubectx'
brew 'node'
brew 'aws-cdk'
brew 'helm'
brew 'cmake'
brew 'pure'
brew 'aws-iam-authenticator'
brew 'bat'
brew 'ripgrep'

cask 'font-jetbrains-mono'
cask 'firefox'
cask 'rectangle'
cask 'scroll-reverser'
cask 'spotify'
cask 'visual-studio-code'
cask 'orbstack'
cask 'mouse-fix'
cask 'obsidian'
cask '1password'
cask 'alacritty'
cask 'calibre'
cask 'reflex'
cask 'netnewswire'
cask 'monitorcontrol'
cask 'bbedit'

# Work
# cask 'docker'
# cask 'notion'
# cask 'google-chrome'
# cask 'slack' 
# cask 'lens'
# cask 'opera'
# cask 'dbeaver-community'
