# taps
tap "hashicorp/tap"
tap "go-task/tap"

# packages
brew 'zsh'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'git'
brew 'vim'
brew 'watch'
brew 'awscli'
brew 'jq'
brew 'tmux'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/terraform-ls'
brew 'telnet'
brew 'awk'
brew 'kubectl'
brew 'kubectx'
brew 'node'
brew 'aws-cdk'
brew 'helm'
brew 'pure'
brew 'aws-iam-authenticator'
brew 'k9s'
brew 'fzf'
brew 'ripgrep'
brew 'go-task/tap/go-task'
brew 'go'
brew 'direnv'
brew 'talosctl'
brew 'opentofu'
brew 'bat'
brew 'lazygit'
brew 'btop'
brew 'circumflex'
brew 'aws-sso-cli'
brew 'mysql-client'
brew 'fish'
brew 'fisher'
brew 'fd'
brew 'smug'
brew 'nvm'
brew 'goreleaser'
brew '514-labs/tap/dnsglobe'
brew 'container'
brew 'zsh-patina'
brew 'fzf-tab'
brew 'helix'

# # desktop apps
cask 'font-jetbrains-mono'
cask 'firefox'
cask 'scroll-reverser'
cask 'spotify'
cask 'visual-studio-code'
cask 'obsidian'
cask '1password'
cask 'calibre'
cask 'netnewswire'
cask 'tailscale-app'
cask 'ghostty'
cask 'rectangle'
cask 'font-jetbrains-mono-nerd-font'
cask 'ungoogled-chromium'
cask 'keepingyouawake'

# # work
# cask 'google-chrome'
# cask 'slack'
# cask 'cloudflare-warp'
