tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew 'zsh'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'tree'
brew 'wget'
brew 'curl'
brew 'git'
brew 'python'
brew 'pipenv'
brew 'ansible'
brew 'vim'
brew 'watch'
brew 'awscli'
brew 'jq'
brew 'tmux'
#brew 'terraform'
brew 'tfenv'
brew 'terraform-ls'
brew 'telnet'
brew 'tree'
brew 'lazygit'
brew 'awk'
brew 'newsboat'
brew 'kubectl'
brew 'kubectx'
brew 'sceptre'
brew 'node'
brew 'aws-cdk'
brew 'helm'
brew 'cmake'
brew 'pure'
brew 'bensadeh/circumflex/circumflex'
brew 'aws-iam-authenticator'

cask 'font-jetbrains-mono'
cask 'google-chrome'
cask 'notion'
cask 'rectangle'
cask 'scroll-reverser'
cask 'spotify'
cask 'visual-studio-code'
cask 'docker'
cask 'mouse-fix'
cask 'obsidian'
cask '1password'
cask 'slack' 
cask 'alacritty'
cask 'things'
cask 'calibre'
cask 'reflex'
cask 'netnewswire'
cask 'monitorcontrol'
cask 'bbedit'
cask 'lens'
cask 'opera'
cask 'dbeaver-community'

mas '1320666476' # wipr 
mas '1569813296' # 1password for safari