amazonwebservices.aws-toolkit-vscode
arcticicestudio.nord-visual-studio-code
atomiks.moonlight
dracula-theme.theme-dracula
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitHub.copilot
Gruntfuggly.todo-tree
hashicorp.terraform
kjaymiller.vscode-add-code-of-conduct
ms-azuretools.vscode-docker
ms-vscode.vscode-typescript-next
rangav.vscode-thunder-client