# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'grep'

# Install Binaries
brew 'tree'
brew 'wget'
brew 'curl'
brew 'git'
brew 'git-extras'
brew 'python'
brew 'ansible'
brew 'sshuttle'
brew 'vim'
brew 'watch'
brew 'mas'
brew 'unrar'
brew 'awscli'

# Apps
cask 'aerial'
cask 'appcleaner'
cask 'dropbox'
cask 'docker'
cask 'dropshare'
cask 'firefox'
cask 'insomnia'
cask 'google-drive'
cask 'iterm2'
cask 'macdown'
cask 'pycharm-ce'
cask 'transmission'
cask 'telegram'
cask 'spotify'
cask 'spotify-notifications'
cask 'skype'
cask 'slack'
cask 'keybase'
cask 'transmit'
cask 'vlc'

# App Store
mas 'Xcode', id:497799835
mas 'Pixelmator', id:407963104
mas 'Deckset', id:847496013
mas 'Amphetamine', id:937984704
mas 'Noizio', id:928871589
mas 'Tweetbot', id:557168941

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
